src/toir_cf/src/ChartsOfCharacteristicTypes/торо_ГруппыХарактеристикОборудования/торо_ГруппыХарактеристикОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>торо_ГруппыХарактеристикОборудования</name>
  <type>
    <types>EnumRef.торо_ТипЭксплуатации</types>
    <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    <types>CatalogRef.торо_МерыБезопасности</types>
    <types>CatalogRef.ВидыНоменклатуры</types>
    <types>CatalogRef.торо_ПричиныИзмененияНаработки</types>
    <types>CatalogRef.торо_ТехнологическиеОперации</types>
    <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
    <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.торо_ТиповыеОР</types>
    <types>CatalogRef.Должности</types>
    <types>CatalogRef.торо_ЦепочкиРемонта</types>
    <types>CatalogRef.УпаковкиНоменклатуры</types>
    <types>EnumRef.Периодичность</types>
    <types>CatalogRef.Сотрудники</types>
    <types>CatalogRef.торо_ВидыПусковОР</types>
    <types>CatalogRef.ПапкиФайлов</types>
    <types>EnumRef.СтавкиНДС</types>
    <types>CatalogRef.торо_ПричиныДефектов</types>
    <types>CatalogRef.торо_РесурсыРемонтнойБригады</types>
    <types>EnumRef.торо_ОтветственныеЛица</types>
    <types>CatalogRef.торо_ОбъектыРемонта</types>
    <types>EnumRef.торо_ВидыСравнения</types>
    <types>EnumRef.ТипыНоменклатуры</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    <types>CatalogRef.торо_ВидыЭксплуатации</types>
    <types>CatalogRef.ЗначенияСвойствОбъектовИерархия</types>
    <types>EnumRef.ГрадацииКачества</types>
    <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>CatalogRef.ВидыЦен</types>
    <types>Boolean</types>
    <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>EnumRef.РолиСотрудников</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.РассылкиОтчетов</types>
    <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    <types>CatalogRef.СерииНоменклатуры</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.ПроизводственныеКалендари</types>
    <types>EnumRef.торо_УсловияРабот</types>
    <types>CatalogRef.торо_ПричиныЗакрытияРемонтов</types>
    <types>String</types>
    <types>CatalogRef.торо_КритичностьДефекта</types>
    <types>CatalogRef.торо_ПричиныПростояОборудования</types>
    <types>Date</types>
    <types>CatalogRef.СтраныМира</types>
    <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
    <types>CatalogRef.торо_СтруктурыОР</types>
    <types>Number</types>
    <types>CatalogRef.торо_ПриоритетыОбъектовРемонта</types>
    <types>CatalogRef.торо_РемонтныеБригады</types>
    <types>CatalogRef.Производители</types>
    <types>EnumRef.торо_СтатусыОРВУчете</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.Организации</types>
    <types>EnumRef.торо_СпособыВыполненияРемонтов</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>EnumRef.ВидыКадровыхСобытий</types>
    <types>CatalogRef.торо_Комиссии</types>
    <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    <types>EnumRef.СпособыСтроительства</types>
    <types>CatalogRef.ЕдиницыИзмерения</types>
    <types>EnumRef.торо_ВидыПростояОборудования</types>
    <types>EnumRef.ТипыСкладов</types>
    <types>EnumRef.ВидыЗанятости</types>
    <types>EnumRef.ТипыДоговоров</types>
    <types>EnumRef.ДниНедели</types>
    <types>CatalogRef.торо_Сезоны</types>
    <types>CatalogRef.Календари</types>
    <types>CatalogRef.торо_ВидыРемонтов</types>
    <types>CatalogRef.СтавкиНДС</types>
    <types>CatalogRef.торо_ВидыДефектов</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>10</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <attributes>
    <name>ЗаполнятьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокХарактеристик</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыАвтозаполнения</name>
    <attributes>
      <name>НаименованиеХарактеристики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

src/toir_cf/src/ChartsOfCharacteristicTypes/торо_ГруппыХарактеристикОборудования/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ТипЗначения = Новый ОписаниеТипов("Число");
	КонецЕсли;
	
	ОбновитьДоступностьТаблиц(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборХарактеристик(Команда)
	
	ПараметрыФормы = Новый Структура("ТипЗначения, ЗакрыватьПриВыборе", Объект.ТипЗначения, Ложь);
	ОткрытьФорму("ПланВидовХарактеристик.торо_ГруппыХарактеристикОборудования.Форма.ФормаПодбораХарактеристик", ПараметрыФормы, Элементы.СписокХарактеристик, Объект.Ссылка,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПараметров(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("ПланВидовХарактеристик.торо_ГруппыХарактеристикОборудования.Форма.ФормаПодбораНаименований", ПараметрыФормы, Элементы.ПараметрыАвтозаполнения, Объект.Ссылка,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаполнятьАвтоматическиПриИзменении(Элемент)
	ОбновитьДоступностьТаблиц(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыАвтозаполнения

&НаКлиенте
Процедура ПараметрыАвтозаполненияНаименованиеХарактеристикиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Истина);
	ОткрытьФорму("ПланВидовХарактеристик.торо_ГруппыХарактеристикОборудования.Форма.ФормаПодбораНаименований", ПараметрыФормы, Элемент, Объект.Ссылка,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыАвтозаполненияНаименованиеХарактеристикиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда  
		МассивСтрок = Объект.ПараметрыАвтозаполнения.НайтиСтроки(Новый Структура("НаименованиеХарактеристики", ВыбранноеЗначение));
		Если МассивСтрок.Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Этот параметр автозаполнения уже добавлен'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыАвтозаполненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда  
		МассивСтрок = Объект.ПараметрыАвтозаполнения.НайтиСтроки(Новый Структура("НаименованиеХарактеристики", ВыбранноеЗначение));
		Если МассивСтрок.Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Этот параметр автозаполнения уже добавлен'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		НСтр = Объект.ПараметрыАвтозаполнения.Добавить();
		НСтр.НаименованиеХарактеристики = ВыбранноеЗначение;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокХарактеристик

&НаКлиенте
Процедура СписокХарактеристикХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ТипЗначения, ЗакрыватьПриВыборе", Объект.ТипЗначения, Истина);
	ОткрытьФорму("ПланВидовХарактеристик.торо_ГруппыХарактеристикОборудования.Форма.ФормаПодбораХарактеристик", ПараметрыФормы, Элемент, Объект.Ссылка,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокХарактеристикХарактеристикаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ТипЗначенияСовпадает = ПроверитьТипЗначения(ВыбранноеЗначение, Объект.ТипЗначения);
		Если НЕ ТипЗначенияСовпадает Тогда
			ТекстСообщения = НСтр("ru = 'Характеристика не соответсвует указанному типу значения'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
		МассивСтрок = Объект.СписокХарактеристик.НайтиСтроки(Новый Структура("Характеристика", ВыбранноеЗначение));
		Если МассивСтрок.Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Эта характеристика уже добавлена'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокХарактеристикОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
		МассивСтрок = Объект.СписокХарактеристик.НайтиСтроки(Новый Структура("Характеристика", ВыбранноеЗначение));
		Если МассивСтрок.Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Эта характеристика уже добавлена'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		НСтр = Объект.СписокХарактеристик.Добавить();
		НСтр.Характеристика = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДоступностьТаблиц(Форма)
	
	Элементы = Форма.Элементы;
	ЗаполнятьАвтоматически = Форма.Объект.ЗаполнятьАвтоматически;
	
	Элементы.СписокХарактеристик.ТолькоПросмотр = ЗаполнятьАвтоматически;
	Элементы.ПараметрыАвтозаполнения.Видимость = ЗаполнятьАвтоматически;
	Элементы.СписокХарактеристикПодборХарактеристик.Доступность = НЕ ЗаполнятьАвтоматически;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьТипЗначения(Характеристика, ТипЗначения)
	
	Возврат ПланыВидовХарактеристик.торо_ГруппыХарактеристикОборудования.ТипЗначенияПодходит(ТипЗначения, Характеристика.ТипЗначения);
	
КонецФункции

#КонецОбласти
